<?php 
	$warehouse = [
		'EEUDCA'=>'顺丰东欧仓',
		'MEUDCA'=>'顺丰中欧仓',
		'USDE'=>'美国特拉华仓',
		'USLA'=>'美国洛杉矶仓',
		'EEUDCANew'=>'顺丰东欧仓-新',
	];
 
	$warehouseService = [
		'EEUDCA'=>[
    		'D4'=>'邮政经济渠道挂号',
    		'D5'=>'邮政经济渠道平邮',
    		'D6'=>'标准快递渠道',
    		'D7'=>'东欧仓EMS渠道',
    		'D34'=>'东欧仓托盘渠道',
    		'D35'=>'东欧仓DPD渠道',
		],
		'MEUDCA'=>[
			'D26'=>'德国邮政小件包裹服务',
			'D27'=>'德国邮政信件服务',
			'D28'=>'欧盟邮政小件服务',
			'D29'=>'德国DHL本地派送服务',
			'D30'=>'欧盟DHL派送服务',
			'D31'=>'德国DHL托盘服务',
			'D36'=>'中欧仓DPD渠道',
			'D37'=>'中欧仓UPS渠道',
			'D38'=>'中欧仓波兰邮政信件平邮服务',
			'D39'=>'中欧仓波兰邮政信件挂号服务',
			'D40'=>'中欧仓波兰邮政包裹挂号服务',
		],
		'USDE'=>[
    		'D1'=>'美国USPS一级服务',
    		'D2'=>'美国USPS大信封服务',
    		'D3'=>'美国USPS优先服务',
			'D32'=>'美国UPS服务',
		],
		'USLA'=>[
    		'D1'=>'美国USPS一级服务',
    		'D2'=>'美国USPS大信封服务',
    		'D3'=>'美国USPS优先服务',
			'D32'=>'美国UPS服务',
		],
		'EEUDCANew'=>[
    		'D4'=>'邮政经济渠道挂号',
    		'D5'=>'邮政经济渠道平邮',
    		'D6'=>'标准快递渠道',
    		'D7'=>'东欧仓EMS渠道',
    		'D34'=>'东欧仓托盘渠道',
    		'D35'=>'东欧仓DPD渠道',
		],
	];

 ?>

